FrancescoSer/sdk-nrf/applications/nrf5340_audio/src/audio/audio_datapath.c
	struct {
		enum drift_comp_state state : 8;
		uint16_t ctr; /* Counting function calls - Used for waiting */
		uint32_t meas_start_time_us;
		uint32_t center_freq;
		bool hfclkaudio_comp_enabled;
	} drift_comp;

	struct {
		enum pres_comp_state state : 8;
		uint16_t ctr; /* Counting function calls - Used for collecting data points and waiting */
		int32_t sum_err_dly_us;
	} pres_comp;
} ctrl_blk;

static bool tone_active;
/* Buffer which can hold max 1 period test tone at 100 Hz */
static uint16_t test_tone_buf[CONFIG_AUDIO_SAMPLE_RATE_HZ / 100];
static size_t test_tone_size;

static void hfclkaudio_set(uint16_t freq_value)
{
	uint16_t freq_val = freq_value;

	freq_val = MIN(freq_val, APLL_FREQ_MAX);
	freq_val = MAX(freq_val, APLL_FREQ_MIN);

	if (!ctrl_blk.drift_comp.hfclkaudio_comp_enabled) {
		return;
	}

	nrfx_clock_hfclkaudio_config_set(freq_val);
}

static void drift_comp_state_set(enum drift_comp_state new_state)
{
	if (new_state == ctrl_blk.drift_comp.state) {
		LOG_WRN("Trying to change to the same drift compensation state");
		return;
	}

	ctrl_blk.drift_comp.ctr = 0;

	ctrl_blk.drift_comp.state = new_state;
	LOG_INF("Drft comp state: %s", drift_comp_state_names[new_state]);
}

/**
 * @brief Adjust frequency of HFCLKAUDIO to get audio in sync
 *
 * @note The audio sync is based on sdu_ref
 *
 * @param frame_start_ts I2S frame start timestamp
 */
static void audio_datapath_drift_compensation(uint32_t frame_start_ts)
{
	switch (ctrl_blk.drift_comp.state) {
	case DRFT_STATE_INIT: {
		/* Check if audio data has been received */
		if (ctrl_blk.previous_sdu_ref_us) {
			ctrl_blk.drift_comp.meas_start_time_us = ctrl_blk.previous_sdu_ref_us;

			drift_comp_state_set(DRFT_STATE_CALIB);
		}
		break;
	}
	case DRFT_STATE_CALIB: {
		if (++ctrl_blk.drift_comp.ctr < DRIFT_COMP_WAITING_CNT) {
			/* Waiting */
			return;
		}

		int32_t err_us = DRIFT_MEAS_PERIOD_US - (ctrl_blk.previous_sdu_ref_us -
							 ctrl_blk.drift_comp.meas_start_time_us);
		int32_t freq_adj = APLL_FREQ_ADJ(err_us);

		ctrl_blk.drift_comp.center_freq = APLL_FREQ_CENTER + freq_adj;

		hfclkaudio_set(ctrl_blk.drift_comp.center_freq);

		drift_comp_state_set(DRFT_STATE_OFFSET);
		break;
	}
	case DRFT_STATE_OFFSET: {
		if (++ctrl_blk.drift_comp.ctr < DRIFT_COMP_WAITING_CNT) {
			/* Waiting */
			return;
		}

		int32_t err_us = (ctrl_blk.previous_sdu_ref_us - frame_start_ts) % BLK_PERIOD_US;

		if (err_us > (BLK_PERIOD_US / 2)) {
			err_us = err_us - BLK_PERIOD_US;
		}

		int32_t freq_adj = APLL_FREQ_ADJ(err_us);

		hfclkaudio_set(ctrl_blk.drift_comp.center_freq + freq_adj);

		if ((err_us < DRIFT_ERR_THRESH_LOCK) && (err_us > -DRIFT_ERR_THRESH_LOCK)) {
			drift_comp_state_set(DRFT_STATE_LOCKED);
		}

		break;
	}
	case DRFT_STATE_LOCKED: {
		if (++ctrl_blk.drift_comp.ctr < DRIFT_COMP_WAITING_CNT) {
			/* Waiting */
			return;
		}

		int32_t err_us = (ctrl_blk.previous_sdu_ref_us - frame_start_ts) % BLK_PERIOD_US;

		if (err_us > (BLK_PERIOD_US / 2)) {
			err_us = err_us - BLK_PERIOD_US;
		}

		/* Use asymptotic correction with small errors */
		err_us /= 2;
		int32_t freq_adj = APLL_FREQ_ADJ(err_us);

		hfclkaudio_set(ctrl_blk.drift_comp.center_freq + freq_adj);

		if ((err_us > DRIFT_ERR_THRESH_UNLOCK) || (err_us < -DRIFT_ERR_THRESH_UNLOCK)) {
			drift_comp_state_set(DRFT_STATE_OFFSET);
		} else {
			ctrl_blk.drift_comp.ctr = 0;
		}

		break;
	}
	default: {
		break;
	}
	}
}

static void pres_comp_state_set(enum pres_comp_state new_state)
{
	int ret;

	if (new_state == ctrl_blk.pres_comp.state) {
		return;
	}

	ctrl_blk.pres_comp.ctr = 0;

	ctrl_blk.pres_comp.state = new_state;
	LOG_INF("Pres comp state: %s", pres_comp_state_names[new_state]);
	if (new_state == PRES_STATE_LOCKED) {
		ret = led_on(LED_APP_2_GREEN);
	} else {
		ret = led_off(LED_APP_2_GREEN);
	}
	ERR_CHK(ret);
}

/**
 * @brief Move audio blocks back and forth in FIFO to get audio in sync
 *
 * @note The audio sync is based on sdu_ref
 *
 * @param cur_time Timestamp of when frame was received
 * @param sdu_ref ISO timestamp reference from BLE controller
 * @param missing_blks Amount of missing blocks (caused by missed frame(s))
 */
static void audio_datapath_presentation_compensation(uint32_t cur_time, uint32_t sdu_ref,
						     uint32_t missing_blks)
{
	if (ctrl_blk.drift_comp.state != DRFT_STATE_LOCKED) {
		/* Unconditionally reset state machine if drift compensation looses lock */
		pres_comp_state_set(PRES_STATE_INIT);
		return;
	}

	/* Move presentation compensation into PRES_STATE_WAIT if audio frame is missed */
	if (missing_blks) {
		LOG_WRN("Missed audio frame");
		pres_comp_state_set(PRES_STATE_WAIT);
	}

	int32_t wanted_pres_dly_us = PRES_DLY_US - (cur_time - sdu_ref);
	int32_t pres_adj_us = 0;

	switch (ctrl_blk.pres_comp.state) {
	case PRES_STATE_INIT: {
		ctrl_blk.pres_comp.sum_err_dly_us = 0;
		pres_comp_state_set(PRES_STATE_MEAS);
		break;
	}
	case PRES_STATE_MEAS: {
		if (ctrl_blk.pres_comp.ctr++ < PRES_COMP_NUM_DATA_PTS) {
			ctrl_blk.pres_comp.sum_err_dly_us +=
				wanted_pres_dly_us - ctrl_blk.current_pres_dly_us;

			/* Same state - Collect more data */
			break;
		}

#if (PRES_COMP_ENABLE)
		pres_adj_us = ctrl_blk.pres_comp.sum_err_dly_us / PRES_COMP_NUM_DATA_PTS;
#endif /* (PRES_COMP_ENABLE) */

		if ((pres_adj_us >= (BLK_PERIOD_US / 2)) || (pres_adj_us <= -(BLK_PERIOD_US / 2))) {
			pres_comp_state_set(PRES_STATE_WAIT);
			break;
		} else {
			/* Drift compensation will always be in DRFT_STATE_LOCKED here */
			pres_comp_state_set(PRES_STATE_LOCKED);
		}

		break;
	}
	case PRES_STATE_WAIT: {
		if (ctrl_blk.pres_comp.ctr++ > (FIFO_SMPL_PERIOD_US / FRAME_DURATION_US)) {
			pres_comp_state_set(PRES_STATE_INIT);
		}

		break;
	}
	case PRES_STATE_LOCKED: {
		/*
		 * Presentation delay compensation moves into PRES_STATE_WAIT if an audio
		 * frame is missed or into PRES_STATE_INIT if drift compensation unlocks.
		 */

		break;
	}
	default: {
		break;
	}
	}

	if (pres_adj_us == 0) {
		return;
	}

	if (pres_adj_us >= 0) {
		pres_adj_us += (BLK_PERIOD_US / 2);
	} else {
		pres_adj_us += -(BLK_PERIOD_US / 2);
	}

	/* Number of adjustment blocks is 0 as long as |pres_adj_us| < BLK_PERIOD_US */
	int32_t pres_adj_blks = pres_adj_us / BLK_PERIOD_US;

