FrancescoSer/sdk-nrf/applications/nrf5340_audio/src/audio/audio_datapath.c
	if (pres_adj_blks > (FIFO_NUM_BLKS / 2)) {
		/* Limit adjustment */
		pres_adj_blks = FIFO_NUM_BLKS / 2;

		LOG_WRN("Requested presentation delay out of range: pres_adj_us=%d", pres_adj_us);
	} else if (pres_adj_blks < -(FIFO_NUM_BLKS / 2)) {
		/* Limit adjustment */
		pres_adj_blks = -(FIFO_NUM_BLKS / 2);

		LOG_WRN("Requested presentation delay out of range: pres_adj_us=%d", pres_adj_us);
	}

	/* Adjust Sample FIFO with missing blocks */
	pres_adj_blks += missing_blks;

	if (pres_adj_blks > 0) {
		LOG_DBG("Presentation delay inserted: pres_adj_blks=%d", pres_adj_blks);

		/* Increase presentation delay */
		for (int i = 0; i < pres_adj_blks; i++) {
			/* Mute audio block */
			memset(&ctrl_blk.out
					.fifo[ctrl_blk.out.prod_blk_idx * BLK_MONO_NUM_SAMPS * 2],
			       0, BLK_STEREO_SIZE_OCTETS);

			/* Record producer block start reference */
			ctrl_blk.out.prod_blk_ts[ctrl_blk.out.prod_blk_idx] =
				cur_time - ((pres_adj_blks - i) * BLK_PERIOD_US);

			ctrl_blk.out.prod_blk_idx = NEXT_IDX(ctrl_blk.out.prod_blk_idx);
		}
	} else if (pres_adj_blks < 0) {
		LOG_DBG("Presentation delay removed: pres_adj_blks=%d", pres_adj_blks);

		/* Reduce presentation delay */
		for (int i = 0; i > pres_adj_blks; i--) {
			ctrl_blk.out.prod_blk_idx = PREV_IDX(ctrl_blk.out.prod_blk_idx);
		}
	}
}

static void tone_stop_worker(struct k_work *work)
{
	tone_active = false;
	memset(test_tone_buf, 0, sizeof(test_tone_buf));
	LOG_DBG("Tone stopped");
}

K_WORK_DEFINE(tone_stop_work, tone_stop_worker);

static void tone_stop_timer_handler(struct k_timer *dummy)
{
	k_work_submit(&tone_stop_work);
};

K_TIMER_DEFINE(tone_stop_timer, tone_stop_timer_handler, NULL);

int audio_datapath_tone_play(uint16_t freq, uint16_t dur_ms, float amplitude)
{
	int ret;

	if (tone_active) {
		return -EBUSY;
	}

	ret = tone_gen(test_tone_buf, &test_tone_size, freq, CONFIG_AUDIO_SAMPLE_RATE_HZ,
		       amplitude);
	RET_IF_ERR(ret);

	/* If duration is 0, play forever */
	if (dur_ms != 0) {
		k_timer_start(&tone_stop_timer, K_MSEC(dur_ms), K_NO_WAIT);
	}

	tone_active = true;
	LOG_DBG("Tone started");
	return 0;
}

void audio_datapath_tone_stop(void)
{
	k_timer_stop(&tone_stop_timer);
	k_work_submit(&tone_stop_work);
}

static void tone_mix(uint8_t *tx_buf)
{
	int ret;
	int8_t tone_buf_continuous[BLK_MONO_SIZE_OCTETS];
	static uint32_t finite_pos;

	ret = contin_array_create(tone_buf_continuous, BLK_MONO_SIZE_OCTETS, test_tone_buf,
				  test_tone_size, &finite_pos);
	ERR_CHK(ret);

	ret = pcm_mix(tx_buf, BLK_STEREO_SIZE_OCTETS, tone_buf_continuous, BLK_MONO_SIZE_OCTETS,
		      B_MONO_INTO_A_STEREO_L);
	ERR_CHK(ret);
}

/* Alternate-buffers used when there is no active audio stream.
 * Used interchangably by I2S.
 */
static struct {
	uint8_t __aligned(WB_UP(1)) buf_0[BLK_STEREO_SIZE_OCTETS];
	uint8_t __aligned(WB_UP(1)) buf_1[BLK_STEREO_SIZE_OCTETS];
	bool buf_0_in_use;
	bool buf_1_in_use;
} alt;

/**
 * @brief Get first available alternative-buffer
 *
 * @param p_buffer Double pointer to populate with buffer
 *
 * @retval 0 if success
 * @retval -ENOMEM No available buffers
 */
static int alt_buffer_get(void **p_buffer)
{
	if (!alt.buf_0_in_use) {
		alt.buf_0_in_use = true;
		*p_buffer = alt.buf_0;
	} else if (!alt.buf_1_in_use) {
		alt.buf_1_in_use = true;
		*p_buffer = alt.buf_1;
	} else {
		return -ENOMEM;
	}

	return 0;
}

/**
 * @brief Checks if pointer matches that of a buffer
 *	      and frees it in one operation
 *
 * @param p_buffer Buffer to free
 */
static void alt_buffer_free(void const *const p_buffer)
{
	if (p_buffer == alt.buf_0) {
		alt.buf_0_in_use = false;
	} else if (p_buffer == alt.buf_1) {
		alt.buf_1_in_use = false;
	} else {
		return;
	}
}

/*
 * This handler function is called every time I2S needs new buffers for
 * TX and RX data.
 *
 * The new TX data buffer is the next consumer block in out.fifo.
 *
 * The new RX data buffer is the first empty slot of in.fifo.
 * New I2S RX data is located in rx_buf_released, and is locked into
 * the in.fifo message queue.
 */
static void audio_datapath_i2s_blk_complete(uint32_t frame_start_ts, uint32_t *rx_buf_released,
					    uint32_t const *tx_buf_released)
{
	int ret;
	static bool underrun_condition;

	alt_buffer_free(tx_buf_released);

	/*** Presentation delay measurement ***/
	ctrl_blk.current_pres_dly_us =
		frame_start_ts - ctrl_blk.out.prod_blk_ts[ctrl_blk.out.cons_blk_idx];

	/********** I2S TX **********/
	static uint8_t *tx_buf;

	/* Double buffered index */
	uint32_t next_out_blk_idx = NEXT_IDX(ctrl_blk.out.cons_blk_idx);

	if (next_out_blk_idx != ctrl_blk.out.prod_blk_idx) {
		/* Only increment if not in underrun condition */
		ctrl_blk.out.cons_blk_idx = next_out_blk_idx;
		if (underrun_condition) {
			underrun_condition = false;
			LOG_WRN("Data received, total underruns: %d",
				ctrl_blk.out.total_blk_underruns);
		}

		tx_buf = (uint8_t *)&ctrl_blk.out.fifo[next_out_blk_idx * BLK_MONO_SIZE_OCTETS];

	} else {
		/* No data available in out.fifo
		 * use alternative buffers
		 */
		ret = alt_buffer_get((void **)&tx_buf);
		ERR_CHK(ret);

		if (!underrun_condition ||
		    ((ctrl_blk.out.total_blk_underruns % UNDERRUN_LOG_INTERVAL_BLKS) == 0)) {
			LOG_WRN("In I2S TX underrun condition, total: %d",
				ctrl_blk.out.total_blk_underruns);
		}

		memset(tx_buf, 0, BLK_STEREO_SIZE_OCTETS);
		underrun_condition = true;
		ctrl_blk.out.total_blk_underruns++;
	}

	if (tone_active) {
		tone_mix(tx_buf);
	}

	/********** I2S RX **********/
	uint32_t *rx_buf;
	static int prev_ret;

	/* Lock last filled buffer into message queue */
	if (rx_buf_released != NULL) {
		ret = data_fifo_block_lock(ctrl_blk.in.fifo, (void **)&rx_buf_released,
					   BLOCK_SIZE_BYTES);

		ERR_CHK_MSG(ret, "Unable to lock block RX");
	}

	/* Get new empty buffer to send to I2S HW */
	ret = data_fifo_pointer_first_vacant_get(ctrl_blk.in.fifo, (void **)&rx_buf, K_NO_WAIT);
	if (ret == 0 && prev_ret == -ENOMEM) {
		LOG_WRN("I2S RX continuing stream");
		prev_ret = ret;
	}

	/* If RX FIFO is filled up */
	if (ret == -ENOMEM) {
		void *data;
		size_t size;

		if (ret != prev_ret) {
			LOG_WRN("I2S RX overrun. Single msg");
			prev_ret = ret;
		}

		ret = data_fifo_pointer_last_filled_get(ctrl_blk.in.fifo, &data, &size, K_NO_WAIT);
		ERR_CHK(ret);

		ret = data_fifo_block_free(ctrl_blk.in.fifo, &data);
		ERR_CHK(ret);

		ret = data_fifo_pointer_first_vacant_get(ctrl_blk.in.fifo, (void **)&rx_buf,
							 K_NO_WAIT);
	}

	ERR_CHK_MSG(ret, "RX failed to get block");

