FrancescoSer/sdk-nrf/applications/nrf5340_audio/src/audio/audio_datapath.c
	/*** Data exchange ***/
	audio_i2s_set_next_buf(tx_buf, rx_buf);

	/*** Drift compensation ***/
	audio_datapath_drift_compensation(frame_start_ts);
}

static void audio_datapath_i2s_start(void)
{
	int ret;

	/* Double buffer I2S */
	uint8_t *tx_buf_one;
	uint8_t *tx_buf_two;
	uint32_t *rx_buf_one;
	uint32_t *rx_buf_two;

	/* TX */
	ctrl_blk.out.cons_blk_idx = PREV_IDX(ctrl_blk.out.cons_blk_idx);
	tx_buf_one =
		(uint8_t *)&ctrl_blk.out.fifo[ctrl_blk.out.cons_blk_idx * BLK_MONO_NUM_SAMPS * 2];

	ctrl_blk.out.cons_blk_idx = PREV_IDX(ctrl_blk.out.cons_blk_idx);
	tx_buf_two =
		(uint8_t *)&ctrl_blk.out.fifo[ctrl_blk.out.cons_blk_idx * BLK_MONO_NUM_SAMPS * 2];

	/* RX */
	uint32_t alloced_cnt;
	uint32_t locked_cnt;

	ret = data_fifo_num_used_get(ctrl_blk.in.fifo, &alloced_cnt, &locked_cnt);
	if (alloced_cnt || locked_cnt || ret) {
		ERR_CHK_MSG(-ENOMEM, "Fifo is not empty!");
	}

	ret = data_fifo_pointer_first_vacant_get(ctrl_blk.in.fifo, (void **)&rx_buf_one, K_NO_WAIT);
	ERR_CHK_MSG(ret, "RX failed to get block");
	ret = data_fifo_pointer_first_vacant_get(ctrl_blk.in.fifo, (void **)&rx_buf_two, K_NO_WAIT);
	ERR_CHK_MSG(ret, "RX failed to get block");

	/* Start I2S */
	audio_i2s_start(tx_buf_one, rx_buf_one);
	audio_i2s_set_next_buf(tx_buf_two, rx_buf_two);
}

static void audio_datapath_i2s_stop(void)
{
	audio_i2s_stop();
}

void audio_datapath_stream_out(const uint8_t *buf, size_t size, uint32_t sdu_ref, bool bad_frame)
{
	uint32_t cur_time = audio_sync_timer_curr_time_get();

	if (!ctrl_blk.stream_started) {
		LOG_WRN("Stream not started");
		return;
	}

	if (sdu_ref == ctrl_blk.previous_sdu_ref_us) {
		LOG_WRN("Duplicate timestamp - Dropping audio frame: sdu_ref=%d", sdu_ref);
		return;
	}

	/*** Check incomming data ***/

	uint32_t missing_blks = 0;

	if (buf && ctrl_blk.previous_sdu_ref_us) {
		uint32_t last_out_delta_us = sdu_ref - ctrl_blk.previous_sdu_ref_us;

		/* Guard against invalid timestamps */
		if (last_out_delta_us < (FRAME_DURATION_US + (FRAME_DURATION_US / 2))) {
			if ((last_out_delta_us >
			     (FRAME_DURATION_US + TIMESTAMP_DELTA_MAX_ERR_US)) ||
			    (last_out_delta_us <
			     (FRAME_DURATION_US - TIMESTAMP_DELTA_MAX_ERR_US))) {
				LOG_WRN("Invalid timestamp delta: %d", last_out_delta_us);

				/* Estimate timestamp */
				last_out_delta_us = FRAME_DURATION_US;
				sdu_ref = ctrl_blk.previous_sdu_ref_us + last_out_delta_us;
			}
		}

		if (last_out_delta_us > (BLK_PERIOD_US / 2)) {
			uint32_t last_out_blk = (last_out_delta_us - (BLK_PERIOD_US / 2)) /
						BLK_PERIOD_US; /* Ensure use of low average */
			missing_blks = (last_out_blk / NUM_BLKS_IN_FRAME) * NUM_BLKS_IN_FRAME;
		} else {
			return;
		}
	}

	if (!bad_frame) {
		ctrl_blk.previous_sdu_ref_us = sdu_ref;
	} else {
		LOG_WRN("Missed audio packet");

		/* Estimate timestamp */
		ctrl_blk.previous_sdu_ref_us += FRAME_DURATION_US;
	}

	/*** Presentation compensation ***/

	audio_datapath_presentation_compensation(cur_time, sdu_ref, missing_blks);

	/*** Decode ***/

	if (buf) {
		int ret;
		size_t pcm_size; /* Not currently in use */

		ret = sw_codec_decode(buf, size, bad_frame, &ctrl_blk.decoded_data, &pcm_size);

		if (ret && !bad_frame) {
			LOG_WRN("SW codec decode error: %d", ret);
		}
	}

	/*** Add audio data to FIFO buffer ***/

	int32_t out_dly_blks = ctrl_blk.out.prod_blk_idx - ctrl_blk.out.cons_blk_idx;

	if ((out_dly_blks + NUM_BLKS_IN_FRAME) > FIFO_NUM_BLKS) {
		LOG_WRN("Output audio stream overrun - Discarding audio frame");

		/* Discard frame to allow consumer to catch up */
		return;
	}

	uint32_t out_blk_idx = ctrl_blk.out.prod_blk_idx;

	for (uint32_t i = 0; i < NUM_BLKS_IN_FRAME; i++) {
		memcpy(&ctrl_blk.out.fifo[out_blk_idx * BLK_MONO_NUM_SAMPS * 2],
		       &((int16_t *)ctrl_blk.decoded_data)[i * BLK_MONO_NUM_SAMPS * 2],
		       BLK_MONO_SIZE_OCTETS * 2);

		/* Record producer block start reference */
		ctrl_blk.out.prod_blk_ts[out_blk_idx] = cur_time + (i * BLK_PERIOD_US);

		out_blk_idx = NEXT_IDX(out_blk_idx);
	}

	/* Advance */
	ctrl_blk.out.prod_blk_idx = out_blk_idx;
}

int audio_datapath_start(struct data_fifo *fifo_rx)
{
	__ASSERT_NO_MSG(fifo_rx != NULL);

	if (!ctrl_blk.datapath_initialized) {
		LOG_WRN("Audio datapath not initialized");
		return -ECANCELED;
	}

	if (!ctrl_blk.stream_started) {
		ctrl_blk.in.fifo = fifo_rx;

		/* Clear counters and mute initial audio */
		memset(&ctrl_blk.out, 0, sizeof(ctrl_blk.out));

		audio_datapath_i2s_start();
		ctrl_blk.stream_started = true;

		return 0;
	} else {
		return -EALREADY;
	}
}

int audio_datapath_stop(void)
{
	if (ctrl_blk.stream_started) {
		ctrl_blk.stream_started = false;
		audio_datapath_i2s_stop();
		ctrl_blk.previous_sdu_ref_us = 0;

		pres_comp_state_set(PRES_STATE_INIT);

		return 0;
	} else {
		return -EALREADY;
	}
}

int audio_datapath_init(void)
{
	memset(&ctrl_blk, 0, sizeof(ctrl_blk));
	audio_i2s_blk_comp_cb_register(audio_datapath_i2s_blk_complete);
	ctrl_blk.datapath_initialized = true;
	ctrl_blk.drift_comp.hfclkaudio_comp_enabled = true;

	return 0;
}

static int cmd_i2s_tone_play(const struct shell *shell, size_t argc, const char **argv)
{
	int ret;
	uint16_t freq;
	uint16_t dur_ms;
	float amplitude;

	if (argc != 4) {
		shell_error(
			shell,
			"3 arguments (freq [Hz], dur [ms], and amplitude [0-1.0] must be provided");
		return -EINVAL;
	}

	if (!isdigit((int)argv[1][0])) {
		shell_error(shell, "Argument 1 is not numeric");
		return -EINVAL;
	}

	if (!isdigit((int)argv[2][0])) {
		shell_error(shell, "Argument 2 is not numeric");
		return -EINVAL;
	}

	freq = strtoul(argv[1], NULL, 10);
	dur_ms = strtoul(argv[2], NULL, 10);
	amplitude = strtof(argv[3], NULL);

	if (amplitude <= 0 || amplitude > 1) {
		shell_error(shell, "Make sure amplitude is 0 < [float] >= 1");
		return -EINVAL;
	}

	shell_print(shell, "Setting tone %d Hz for %d ms", freq, dur_ms);
	ret = audio_datapath_tone_play(freq, dur_ms, amplitude);

	if (ret == -EBUSY) {
		/* Abort continuous running tone with new tone */
		audio_datapath_tone_stop();
		ret = audio_datapath_tone_play(freq, dur_ms, amplitude);
	}

	if (ret) {
		shell_print(shell, "Tone failed with code %d", ret);
	}

	shell_print(shell, "Tone play: %d Hz for %d ms with amplitude %.02f", freq, dur_ms,
		    amplitude);

	return ret;
}

static int cmd_i2s_tone_stop(const struct shell *shell, size_t argc, const char **argv)
{
	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	audio_datapath_tone_stop();

	shell_print(shell, "Tone stop");

	return 0;
}

static int cmd_hfclkaudio_drift_comp_enable(const struct shell *shell, size_t argc,
					    const char **argv)
{
	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	ctrl_blk.drift_comp.hfclkaudio_comp_enabled = true;

	shell_print(shell, "Audio PLL drift compensation enabled");

	return 0;
}

static int cmd_hfclkaudio_drift_comp_disable(const struct shell *shell, size_t argc,
					     const char **argv)
{
	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	ctrl_blk.drift_comp.hfclkaudio_comp_enabled = false;

	shell_print(shell, "Audio PLL drift compensation disabled");

	return 0;
}

SHELL_STATIC_SUBCMD_SET_CREATE(test_cmd,
			       SHELL_COND_CMD(CONFIG_SHELL, nrf_tone_start, NULL,
					      "Start local tone from nRF5340.", cmd_i2s_tone_play),
			       SHELL_COND_CMD(CONFIG_SHELL, nrf_tone_stop, NULL,
					      "Stop local tone from nRF5340.", cmd_i2s_tone_stop),
			       SHELL_COND_CMD(CONFIG_SHELL, pll_comp_enable, NULL,
					      "Enable audio PLL auto drift compensation (default).",
					      cmd_hfclkaudio_drift_comp_enable),
			       SHELL_COND_CMD(CONFIG_SHELL, pll_comp_disable, NULL,
					      "Disable audio PLL auto drift compensation",
					      cmd_hfclkaudio_drift_comp_disable),
			       SHELL_SUBCMD_SET_END);

SHELL_CMD_REGISTER(test, &test_cmd, "Test mode commands", NULL);
